fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_УчетОтпусков/ВКМ_УчетОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_УчетОтпусков</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 

	Для каждого Строка Из ОтпускаСотрудников Цикл   
		
		Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
			Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда  
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке №%1 не верно заполнен период", Строка.НомерСтроки)); 
				Отказ = Истина; 
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;  

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_УчетОтпусков.Записывать = Истина;
				
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
			|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
			|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
			|		ДЕНЬ) + 1 КАК КоличествоДней
			|ИЗ
			|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
			|ГДЕ
			|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
			|ИТОГИ
			|	СУММА(КоличествоДней)
			|ПО
			|	Сотрудник";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	БазаОтпуска = 28;
	
	Пока Результат.Следующий() Цикл
		
		ПревышеноДней = Результат.КоличествоДней - БазаОтпуска;
		
		Если ПревышеноДней > 0 Тогда     
			
			Отказ = Истина;

			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Привышено количество дней отпуска в год по сотруднику %1", Результат.Сотрудник));  
			
		КонецЕсли; 
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;    
		
		РезультатДетально = Результат.Выбрать();
		
		Пока РезультатДетально.Следующий() Цикл
			
			Движение = Движения.ВКМ_УчетОтпусков.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = РезультатДетально.ДатаОкончания;
			Движение.Сотрудник = РезультатДетально.Сотрудник;
			Движение.Значение = РезультатДетально.КоличествоДней;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
